---
kind: method
id: M:Autodesk.Revit.DB.BasePoint.GetSurveyPoint(Autodesk.Revit.DB.Document)
source: html/044d6e50-c766-ae07-0e2d-e1f1e69391be.htm
---
# Autodesk.Revit.DB.BasePoint.GetSurveyPoint Method

Gets the survey point for the document.

## Syntax (C#)
```csharp
public static BasePoint GetSurveyPoint(
	Document cda
)
```

## Parameters
- **cda** (`Autodesk.Revit.DB.Document`) - The document from which to get the survey point.

## Returns
The survey point of the document.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null